app/views/events/_form.html.erb

SELECT "locations".* FROM "locations"
SELECT  1 AS one FROM "locations" INNER JOIN "events_locations" ON "locations"."id" = "events_locations"."location_id" WHERE "events_locations"."event_id" = ? AND "locations"."id" = 1 LIMIT 1  [["event_id", 1]]
---

  <% Location.all.each do |location| %>
    <% if ! @event.locations.include? location %>